app/Controllers/Alat.php

    public function simpan()
    {
        $db = \Config\Database::connect();

        $db->table('alat')->insert([
            'nama_alat' => $this->request->getPost('nama_alat'),
            'deskripsi' => $this->request->getPost('deskripsi'),
            'jumlah' => $this->request->getPost('persediaan')
        ]);
---
INSERT INTO `alat` (`nama_alat`, `deskripsi`, `jumlah`) VALUES ('Laptop', 'qew', '1')