app/Controllers/Alat.php

    public function data()
    {
        $db = \Config\Database::connect();
        $alat = $db->table('alat')->get()->getResultArray();
---
SELECT *
FROM `alat`

    public function peminjaman()
    {
        $db = \Config\Database::connect();
        $alat = $db->table('alat')->get()->getResultArray();
---
SELECT *
FROM `alat`

    public function simpan()
    {
        $db = \Config\Database::connect();

        $db->table('alat')->insert([
            'nama_alat' => $this->request->getPost('nama_alat'),
            'deskripsi' => $this->request->getPost('deskripsi'),
            'jumlah' => $this->request->getPost('persediaan')
        ]);
---
INSERT INTO `alat` (`nama_alat`, `deskripsi`, `jumlah`) VALUES ('Laptop', 'eeeeee', '1')

    public function notifCount()
    {
        $db = \Config\Database::connect();

        $total = $db->table('notif')
            ->where('status', 'unread')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `notif`
WHERE `status` = 'unread'