app/Controllers/Peminjaman.php

SELECT *
FROM `alat`
WHERE `id_alat` = '7'
---
    public function form($id)
    {
        $db = \Config\Database::connect();

        $alat = $db->table('alat')
            ->where('id_alat', $id)
            ->get()
            ->getRowArray();